# RibbonButtonOptions Class

---
A utility class containing the Revit.ini options settings related to ribbon buttons
SystemObject Autodesk.Revit.UIRibbonButtonOptions
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class RibbonButtonOptions : IDisposable

    Public Class RibbonButtonOptions
    	Implements IDisposable

    public ref class RibbonButtonOptions : IDisposable

    type RibbonButtonOptions =
        class
            interface IDisposable
        end
The RibbonButtonOptions type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the RibbonButtonOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.UI Namespace